luoyiliang/xiao-esp32s3-sense-lab/vendor/DFRobot_BMI323-patched/src/bmi3_defs.h
/*! To define Self-test enable modes */
#define BMI3_ST_ACCEL_ONLY   UINT8_C(1)
#define BMI3_ST_GYRO_ONLY    UINT8_C(2)
#define BMI3_ST_BOTH_ACC_GYR UINT8_C(3)

/*! Soft-reset delay */
#define BMI3_SOFT_RESET_DELAY UINT16_C(1500)

/*! Macro to define read data(0x03 to 0x0F) length */
#define BMI3_READ_REG_DATA_LEN UINT8_C(26)

/***************************************************************************** */
/*!         Sensor Macro Definitions                 */
/***************************************************************************** */
/*! Macros to define BMI3 sensor/feature types */
#define BMI3_ACCEL           UINT8_C(0)
#define BMI3_GYRO            UINT8_C(1)
#define BMI3_SIG_MOTION      UINT8_C(2)
#define BMI3_ANY_MOTION      UINT8_C(3)
#define BMI3_NO_MOTION       UINT8_C(4)
#define BMI3_STEP_COUNTER    UINT8_C(5)
#define BMI3_TILT            UINT8_C(6)
#define BMI3_ORIENTATION     UINT8_C(7)
#define BMI3_FLAT            UINT8_C(8)
#define BMI3_TAP             UINT8_C(9)
#define BMI3_ALT_ACCEL       UINT8_C(10)
#define BMI3_ALT_GYRO        UINT8_C(11)
#define BMI3_ALT_AUTO_CONFIG UINT8_C(12)

/*! Non virtual sensor features */
#define BMI3_TEMP           UINT8_C(13)
#define BMI3_I3C_SYNC_ACCEL UINT8_C(14)
#define BMI3_I3C_SYNC_GYRO  UINT8_C(15)
#define BMI3_I3C_SYNC_TEMP  UINT8_C(16)

#define BMI3_16_BIT_RESOLUTION UINT8_C(16)

/*! Masks for mapping of config major and minor mask instances in the system */
#define BMI3_CONFIG_1_MAJOR_MASK UINT16_C(0xFC00)
#define BMI3_CONFIG_1_MINOR_MASK UINT16_C(0x03FF)
#define BMI3_CONFIG_2_MAJOR_MASK UINT16_C(0xFC00)
#define BMI3_CONFIG_2_MINOR_MASK UINT16_C(0x03FF)

/*! Bit position for config version */
#define BMI3_CONFIG_POS UINT8_C(10)

/*! BMI3 I2C address */
#define BMI3_ADDR_I2C_PRIM UINT8_C(0x68)
#define BMI3_ADDR_I2C_SEC  UINT8_C(0x69)

/********************************************************* */
/*!                 Register Addresses                    */
/********************************************************* */

/*! To define the chip id address */
#define BMI3_REG_CHIP_ID UINT8_C(0x00)

/*! Reports sensor error conditions */
#define BMI3_REG_ERR_REG UINT8_C(0x01)

/*! Sensor status flags */
#define BMI3_REG_STATUS UINT8_C(0x02)

/*! ACC Data X. */
#define BMI3_REG_ACC_DATA_X UINT8_C(0x03)

/*! ACC Data Y. */
#define BMI3_REG_ACC_DATA_Y UINT8_C(0x04)

/*! ACC Data Z. */
#define BMI3_REG_ACC_DATA_Z UINT8_C(0x05)

/*! GYR Data X. */
#define BMI3_REG_GYR_DATA_X UINT8_C(0x06)

/*! GYR Data Y. */
#define BMI3_REG_GYR_DATA_Y UINT8_C(0x07)

/*! GYR Data Z. */
#define BMI3_REG_GYR_DATA_Z UINT8_C(0x08)

/*! Temperature Data.
 *  The resolution is 256 LSB/K.
 *  0x0000 -> 23 degree Celsius
 *  0x8000 -> invalid
 */
#define BMI3_REG_TEMP_DATA UINT8_C(0x09)

/*! Sensor time LSW (15:0). */
#define BMI3_REG_SENSOR_TIME_0 UINT8_C(0x0A)

/*! Sensor time MSW (31:16). */
#define BMI3_REG_SENSOR_TIME_1 UINT8_C(0x0B)

/*! Saturation flags for each sensor and axis. */
#define BMI3_REG_SAT_FLAGS UINT8_C(0x0C)

/*! INT1 Status Register.
 *  This register is clear-on-read.
 */
#define BMI3_REG_INT_STATUS_INT1 UINT8_C(0x0D)

/*! INT2 Status Register.
 *  This register is clear-on-read.
 */
#define BMI3_REG_INT_STATUS_INT2 UINT8_C(0x0E)

/*! I3C IBI Status Register.
 *  This register is clear-on-read.
 */
#define BMI3_REG_INT_STATUS_IBI UINT8_C(0x0F)

/*! Feature engine configuration, before setting/changing an active configuration the register must be cleared
(set to 0) */
#define BMI3_REG_FEATURE_IO0 UINT8_C(0x10)

/*! Feature engine I/O register 0. */
#define BMI3_REG_FEATURE_IO1 UINT8_C(0x11)

/*! Feature engine I/O register 1. */
#define BMI3_REG_FEATURE_IO2 UINT8_C(0x12)

/*! Feature engine I/O register 2. */
#define BMI3_REG_FEATURE_IO3 UINT8_C(0x13)

/*! Feature I/O synchronization status and trigger. */
#define BMI3_REG_FEATURE_IO_STATUS UINT8_C(0x14)

/*! FIFO fill state in words */
#define BMI3_REG_FIFO_FILL_LEVEL UINT8_C(0x15)

/*! FIFO data output register */
#define BMI3_REG_FIFO_DATA UINT8_C(0x16)

/*! Sets the output data rate, bandwidth, range and the mode of the accelerometer */
#define BMI3_REG_ACC_CONF UINT8_C(0x20)

/*! Sets the output data rate, bandwidth, range and the mode of the gyroscope in the sensor */
#define BMI3_REG_GYR_CONF UINT8_C(0x21)

/*! Sets the alternative output data rate, bandwidth, range and the mode of the accelerometer */
#define BMI3_REG_ALT_ACC_CONF UINT8_C(0x28)

/*! Sets the alternative output data rate, bandwidth, range and the mode of the gyroscope */
#define BMI3_REG_ALT_GYR_CONF UINT8_C(0x29)

/*! Alternate configuration control */
#define BMI3_REG_ALT_CONF UINT8_C(0x2A)

/*! Reports the active configuration for the accelerometer and gyroscope */
#define BMI3_REG_ALT_STATUS UINT8_C(0x2B)

/*! FIFO watermark level */
#define BMI3_REG_FIFO_WATERMARK UINT8_C(0x35)

/*! Configuration of the FIFO data buffer behaviour */
#define BMI3_REG_FIFO_CONF UINT8_C(0x36)

/*! Control of the FIFO data buffer */
#define BMI3_REG_FIFO_CTRL UINT8_C(0x37)

/*! Configures the electrical behavior of the interrupt pins */
#define BMI3_REG_IO_INT_CTRL UINT8_C(0x38)

/*! Interrupt Configuration Register. */
#define BMI3_REG_INT_CONF UINT8_C(0x39)

/*! Mapping of feature engine interrupts to outputs */
#define BMI3_REG_INT_MAP1 UINT8_C(0x3A)

/*! Mapping of feature engine interrupts, data ready interrupts for signals and FIFO buffer interrupts to outputs */
#define BMI3_REG_INT_MAP2 UINT8_C(0x3B)

/*! Feature engine control register */
#define BMI3_REG_FEATURE_CTRL UINT8_C(0x40)

/*! Address register for feature data: configurations and extended output. */
#define BMI3_REG_FEATURE_DATA_ADDR UINT8_C(0x41)

/*! I/O port for the data values of the feature engine. */
#define BMI3_REG_FEATURE_DATA_TX UINT8_C(0x42)

/*! Status of the data access to the feature engine. */
#define BMI3_REG_FEATURE_DATA_STATUS UINT8_C(0x43)

/*! Status of the feature engine. */
#define BMI3_REG_FEATURE_ENGINE_STATUS UINT8_C(0x45)

/*! Register of extended data on feature events. The register content is valid in combination with an active bit
in INT_STATUS_INT1/2. */
#define BMI3_REG_FEATURE_EVENT_EXT UINT8_C(0x47)

