luoyiliang/xiao-esp32s3-sense-lab/vendor/DFRobot_BMI323-patched/src/bmi3_defs.h
/*! Pull down behavior control */
#define BMI3_REG_IO_PDN_CTRL UINT8_C(0x4F)

/*! Configuration register for the SPI interface */
#define BMI3_REG_IO_SPI_IF UINT8_C(0x50)

/*! Configuration register for the electrical characteristics of the pads */
#define BMI3_REG_IO_PAD_STRENGTH UINT8_C(0x51)

/*! Configuration register for the I2C interface. */
#define BMI3_REG_IO_I2C_IF UINT8_C(0x52)

/*! ODR Deviation Trim Register (OTP backed) - User mirror register */
#define BMI3_REG_IO_ODR_DEVIATION UINT8_C(0x53)

/*! Data path register for the accelerometer offset of axis x */
#define BMI3_REG_ACC_DP_OFF_X UINT8_C(0x60)

/*! Data path register for the accelerometer re-scale of axis x */
#define BMI3_REG_ACC_DP_DGAIN_X UINT8_C(0x61)

/*! Data path register for the accelerometer offset of axis y */
#define BMI3_REG_ACC_DP_OFF_Y UINT8_C(0x62)

/*! Data path register for the accelerometer re-scale of axis y */
#define BMI3_REG_ACC_DP_DGAIN_Y UINT8_C(0x63)

/*! Data path register for the accelerometer offset of axis z */
#define BMI3_REG_ACC_DP_OFF_Z UINT8_C(0x64)

/*! Data path register for the accelerometer re-scale of axis z */
#define BMI3_REG_ACC_DP_DGAIN_Z UINT8_C(0x65)

/*! Data path register for the gyroscope offset of axis x */
#define BMI3_REG_GYR_DP_OFF_X UINT8_C(0x66)

/*! Data path register for the gyroscope re-scale of axis x */
#define BMI3_REG_GYR_DP_DGAIN_X UINT8_C(0x67)

/*! Data path register for the gyroscope offset of axis y */
#define BMI3_REG_GYR_DP_OFF_Y UINT8_C(0x68)

/*! Data path register for the gyroscope re-scale of axis y */
#define BMI3_REG_GYR_DP_DGAIN_Y UINT8_C(0x69)

/*! Data path register for the gyroscope offset of axis z */
#define BMI3_REG_GYR_DP_OFF_Z UINT8_C(0x6A)

/*! Data path register for the gyroscope re-scale of axis z */
#define BMI3_REG_GYR_DP_DGAIN_Z UINT8_C(0x6B)

/*! I3C Timing Control Sync TPH Register */
#define BMI3_REG_I3C_TC_SYNC_TPH UINT8_C(0x70)

/*! I3C Timing Control Sync TU Register */
#define BMI3_REG_I3C_TC_SYNC_TU UINT8_C(0x71)

/*! I3C Timing Control Sync ODR Register */
#define BMI3_REG_I3C_TC_SYNC_ODR UINT8_C(0x72)

/*! Command Register */
#define BMI3_REG_CMD UINT8_C(0x7E)

/*! Reserved configuration */
#define BMI3_REG_CFG_RES UINT8_C(0x7F)

/*! Macro to define start address of data in RAM patch */
#define BMI3_CONFIG_ARRAY_DATA_START_ADDR UINT8_C(4)

/********************************************************* */
/*!               Macros for bit masking                  */
/********************************************************* */

/*! Chip id. */
#define BMI3_CHIP_ID_MASK UINT16_C(0x00FF)

#define BMI3_REV_ID_MASK UINT8_C(0xF0)
#define BMI3_REV_ID_POS  UINT8_C(4)

/*! Fatal Error, chip is not in operational state (Boot-, power-system). This flag will be reset only by power-on-reset
 * or soft-reset. */
#define BMI3_FATAL_ERR_MASK UINT16_C(0x0001)

/*! Overload of the feature engine detected. This flag is clear-on-read. */
#define BMI3_FEAT_ENG_OVRLD_MASK UINT16_C(0x0004)
#define BMI3_FEAT_ENG_OVRLD_POS  UINT8_C(2)

/*! Watchdog timer of the feature engine triggered. This flag is clear-on-read. */
#define BMI3_FEAT_ENG_WD_MASK UINT16_C(0x0010)
#define BMI3_FEAT_ENG_WD_POS  UINT8_C(4)

/*! Unsupported accelerometer configuration set by user. This flag will be reset when configuration has been corrected.
 * */
#define BMI3_ACC_CONF_ERR_MASK UINT16_C(0x0020)
#define BMI3_ACC_CONF_ERR_POS  UINT8_C(5)

/*! Unsupported gyroscope configuration set by user.
 * This flag will be reset when configuration has been corrected.
 */
#define BMI3_GYR_CONF_ERR_MASK UINT16_C(0x0040)
#define BMI3_GYR_CONF_ERR_POS  UINT8_C(6)

/*! SDR parity error or read abort condition (maximum clock stall time for I3C Read Trasfer) occurred.
 *  This flag is a clear-on-read type. It is cleared automatically once read.
 *  Refer to the MIPI I3C specification chapter 'Master Clock Stalling' for detail info regarding the read abort
 * condition.
 */
#define BMI3_I3C_ERROR0_MASK UINT16_C(0x0100)
#define BMI3_I3C_ERROR0_POS  UINT8_C(8)

/*! S0/S1 error occurred. When S0/S1 error occurs, the slave will recover automatically after 60 us as if we see a
 * HDR-exit pattern on the bus while the flag will persist for notification purpose.
 * This flag is clear-on-read type. It is cleared automatically once read.
 */
#define BMI3_I3C_ERROR3_MASK UINT16_C(0x0800)
#define BMI3_I3C_ERROR3_POS  UINT8_C(11)

/*! '1' after device power up or soft-reset. This flag is clear-on-read. */
#define BMI3_POR_DETECTED_MASK UINT16_C(0x0001)

/*! Data ready for Temperature. This flag is clear-on-read. */
#define BMI3_DRDY_TEMP_MASK UINT16_C(0x0020)
#define BMI3_DRDY_TEMP_POS  UINT8_C(5)

/*! Data ready for Gyroscope. This flag is clear-on-read. */
#define BMI3_DRDY_GYR_MASK UINT16_C(0x0040)
#define BMI3_DRDY_GYR_POS  UINT8_C(6)

/*! Data ready for Accelerometer. This flag is clear-on-read. */
#define BMI3_DRDY_ACC_MASK UINT16_C(0x0080)
#define BMI3_DRDY_ACC_POS  UINT8_C(7)

/*! Accel x-axis mask and bit position */
#define BMI3_ACC_X_MASK UINT16_C(0xFFFF)

/*! Accel y-axis mask and bit position */
#define BMI3_ACC_Y_MASK UINT16_C(0xFFFF)

/*! Accel z-axis mask and bit position */
#define BMI3_ACC_Z_MASK UINT16_C(0xFFFF)

/*! Gyro x-axis mask and bit position */
#define BMI3_GYR_X_MASK UINT16_C(0xFFFF)

/*! Gyro y-axis mask and bit position */
#define BMI3_GYR_Y_MASK UINT16_C(0xFFFF)

/*! Gyro z-axis mask and bit position */
#define BMI3_GYR_Z_MASK UINT16_C(0xFFFF)

/*! Temperature value.
 *  T (deg C) := temp_data/512 + 23
 */
#define BMI3_TEMP_DATA_MASK UINT16_C(0xFFFF)

/*! Sensor time LSW (15:0) */
#define BMI3_SENSOR_TIME_15_0_MASK UINT16_C(0xFFFF)

/*! Sensor time MSW (31:16) */
#define BMI3_SENSOR_TIME_31_16_MASK UINT16_C(0xFFFF)

/*! Saturation flag for accel X axis */
#define BMI3_SATF_ACC_X_MASK UINT16_C(0x0001)

/*! Saturation flag for accel Y axis */
#define BMI3_SATF_ACC_Y_MASK UINT16_C(0x0002)
#define BMI3_SATF_ACC_Y_POS  UINT8_C(1)

/*! Saturation flag for accel Z axis */
#define BMI3_SATF_ACC_Z_MASK UINT16_C(0x0004)
#define BMI3_SATF_ACC_Z_POS  UINT8_C(2)

/*! Saturation flag for gyro X axis */
#define BMI3_SATF_GYR_X_MASK UINT16_C(0x0008)
#define BMI3_SATF_GYR_X_POS  UINT8_C(3)

