luoyiliang/xiao-esp32s3-sense-lab/vendor/DFRobot_BMI323-patched/src/bmi3_defs.h
/*! Saturation flag for gyro Y axis */
#define BMI3_SATF_GYR_Y_MASK UINT16_C(0x0010)
#define BMI3_SATF_GYR_Y_POS  UINT8_C(4)

/*! Saturation flag for gyro Z axis */
#define BMI3_SATF_GYR_Z_MASK UINT16_C(0x0020)
#define BMI3_SATF_GYR_Z_POS  UINT8_C(5)

/*! IBI status macros */
#define BMI3_IBI_NO_MOTION_MASK UINT16_C(0x0001)

#define BMI3_IBI_ANY_MOTION_MASK UINT16_C(0x0002)
#define BMI3_IBI_ANY_MOTION_POS  UINT8_C(1)

#define BMI3_IBI_FLAT_MASK UINT16_C(0x0004)
#define BMI3_IBI_FLAT_POS  UINT8_C(2)

#define BMI3_IBI_ORIENTATION_MASK UINT16_C(0x0008)
#define BMI3_IBI_ORIENTATION_POS  UINT8_C(3)

#define BMI3_IBI_STEP_DETECTOR_MASK UINT16_C(0x0010)
#define BMI3_IBI_STEP_DETECTOR_POS  UINT8_C(4)

#define BMI3_IBI_STEP_COUNTER_MASK UINT16_C(0x0020)
#define BMI3_IBI_STEP_COUNTER_POS  UINT8_C(5)

#define BMI3_IBI_SIG_MOTION_MASK UINT16_C(0x0040)
#define BMI3_IBI_SIG_MOTION_POS  UINT8_C(6)

#define BMI3_IBI_TILT_MASK UINT16_C(0x0080)
#define BMI3_IBI_TILT_POS  UINT8_C(7)

#define BMI3_IBI_TAP_MASK UINT16_C(0x0100)
#define BMI3_IBI_TAP_POS  UINT8_C(8)

#define BMI3_IBI_I3C_MASK UINT16_C(0x0200)
#define BMI3_IBI_I3C_POS  UINT8_C(9)

#define BMI3_IBI_ERR_STATUS_MASK UINT16_C(0x0400)
#define BMI3_IBI_ERR_STATUS_POS  UINT8_C(10)

#define BMI3_IBI_TEMP_DRDY_MASK UINT16_C(0x0800)
#define BMI3_IBI_TEMP_DRDY_POS  UINT8_C(11)

#define BMI3_IBI_GYR_DRDY_MASK UINT16_C(0x1000)
#define BMI3_IBI_GYR_DRDY_POS  UINT8_C(12)

#define BMI3_IBI_ACC_DRDY_MASK UINT16_C(0x2000)
#define BMI3_IBI_ACC_DRDY_POS  UINT8_C(13)

#define BMI3_IBI_FWM_MASK UINT16_C(0x4000)
#define BMI3_IBI_FWM_POS  UINT8_C(14)

#define BMI3_IBI_FFULL_MASK UINT16_C(0x8000)
#define BMI3_IBI_FFULL_POS  UINT8_C(15)

/*! No-motion detection output */
#define BMI3_NO_MOTION_X_EN_MASK UINT16_C(0x0001)

/*! No-motion detection output */
#define BMI3_NO_MOTION_Y_EN_MASK UINT16_C(0x0002)
#define BMI3_NO_MOTION_Y_EN_POS  UINT8_C(1)

/*! No-motion detection output */
#define BMI3_NO_MOTION_Z_EN_MASK UINT16_C(0x0004)
#define BMI3_NO_MOTION_Z_EN_POS  UINT8_C(2)

/*! Any-motion detection output */
#define BMI3_ANY_MOTION_X_EN_MASK UINT16_C(0x0008)
#define BMI3_ANY_MOTION_X_EN_POS  UINT8_C(3)

/*! Any-motion detection output */
#define BMI3_ANY_MOTION_Y_EN_MASK UINT16_C(0x0010)
#define BMI3_ANY_MOTION_Y_EN_POS  UINT8_C(4)

/*! Any-motion detection output */
#define BMI3_ANY_MOTION_Z_EN_MASK UINT16_C(0x0020)
#define BMI3_ANY_MOTION_Z_EN_POS  UINT8_C(5)

/*! Flat detection output */
#define BMI3_FLAT_EN_MASK UINT16_C(0x0040)
#define BMI3_FLAT_EN_POS  UINT8_C(6)

/*! Orientation detection output */
#define BMI3_ORIENTATION_EN_MASK UINT16_C(0x0080)
#define BMI3_ORIENTATION_EN_POS  UINT8_C(7)

/*! Step detector output */
#define BMI3_STEP_DETECTOR_EN_MASK UINT16_C(0x0100)
#define BMI3_STEP_DETECTOR_EN_POS  UINT8_C(8)

/*! Step counter watermark output */
#define BMI3_STEP_COUNTER_EN_MASK UINT16_C(0x0200)
#define BMI3_STEP_COUNTER_EN_POS  UINT8_C(9)

/*! Sigmotion detection output */
#define BMI3_SIG_MOTION_EN_MASK UINT16_C(0x0400)
#define BMI3_SIG_MOTION_EN_POS  UINT8_C(10)

/*! Tilt detection output */
#define BMI3_TILT_EN_MASK UINT16_C(0x0800)
#define BMI3_TILT_EN_POS  UINT8_C(11)

/*! Tap detection output */
#define BMI3_TAP_DETECTOR_S_TAP_EN_MASK UINT16_C(0x1000)
#define BMI3_TAP_DETECTOR_S_TAP_EN_POS  UINT8_C(12)

#define BMI3_TAP_DETECTOR_D_TAP_EN_MASK UINT16_C(0x2000)
#define BMI3_TAP_DETECTOR_D_TAP_EN_POS  UINT8_C(13)

#define BMI3_TAP_DETECTOR_T_TAP_EN_MASK UINT16_C(0x4000)
#define BMI3_TAP_DETECTOR_T_TAP_EN_POS  UINT8_C(14)

#define BMI3_I3C_SYNC_FILTER_EN_MASK UINT16_C(0x0001)

#define BMI3_I3C_SYNC_EN_MASK UINT16_C(0x8000)
#define BMI3_I3C_SYNC_EN_POS  UINT8_C(15)

/*! Error and status information */
#define BMI3_ERROR_STATUS_MASK UINT16_C(0x000F)

#define BMI3_FEAT_ENG_INACT_MASK UINT8_C(0x0)

#define BMI3_FEAT_ENG_ACT_MASK UINT8_C(0x1)

#define BMI3_INIT_CRC_ERR_MASK UINT8_C(0x3)

#define BMI3_UGAIN_OFFS_UPD_ERR_MASK UINT8_C(0x4)

#define BMI3_NO_ERROR_MASK UINT8_C(0x5)

#define BMI3_AXIS_MAP_ERR_MASK UINT8_C(0x6)

#define BMI3_TCSYNC_CONF_ERR_MASK UINT8_C(0x8)

#define BMI3_SC_ST_ABORTED_MASK UINT8_C(0x9)

#define BMI3_SC_IGNORED_MASK UINT8_C(0xA)

#define BMI3_ST_IGNORED_MASK UINT8_C(0xB)

#define BMI3_SC_ST_PRECON_ERR_MASK UINT8_C(0xC)

#define BMI3_MODE_CHANGE_WHILE_SC_ST_MASK UINT8_C(0xD)

#define BMI3_POSTPONE_I3C_SYNC_MASK UINT8_C(0xE)

#define BMI3_MODE_CHANGE_WHILE_I3C_SYNC_MASK UINT8_C(0xF)

/*! Self-calibration (gyroscope only) or self-test (accelerometer and/or gyroscope) execution status. 0 indicates that
 * the procedure is ongoing. 1 indicates that the procedure is completed. */
#define BMI3_SC_ST_COMPLETE_MASK UINT16_C(0x0010)
#define BMI3_SC_ST_COMPLETE_POS  UINT8_C(4)

/*! Gyroscope self-calibration result (1=OK, 0=Not OK). Bit sc_st_complete should be 1 prior to reading this bit. */
#define BMI3_GYRO_SC_RESULT_MASK UINT16_C(0x0020)
#define BMI3_GYRO_SC_RESULT_POS  UINT8_C(5)

/*! Accelerometer and/or gyroscope self-test result (1=OK, 0=Not OK). Bit sc_st_complete should be 1 prior to reading
 * this bit. */
#define BMI3_ST_RESULT_MASK UINT16_C(0x0040)
#define BMI3_ST_RESULT_POS  UINT8_C(6)

/*! Insufficient sample rate for either 50Hz or 200Hz or I3C TC-sync feature */
#define BMI3_SAMPLE_RATE_ERR_MASK UINT16_C(0x0080)
#define BMI3_SAMPLE_RATE_ERR_POS  UINT8_C(7)

/*! User gain/offset update execution status. 0 indicates that the procedure is ongoing. 1 indicates that the procedure
 * is completed */
#define BMI3_UGAIN_OFFS_UPD_COMPLETE_MASK UINT16_C(0x0100)
#define BMI3_UGAIN_OFFS_UPD_COMPLETE_POS  UINT8_C(8)

/*! Axis mapping completed */
#define BMI3_AXIS_MAP_COMPLETE_MASK UINT16_C(0x0400)
#define BMI3_AXIS_MAP_COMPLETE_POS  UINT8_C(10)

/*! Current state of the system */
#define BMI3_STATE_MASK UINT16_C(0x1800)
#define BMI3_STATE_POS  UINT8_C(11)

/*! Before feature engine enable: Feature engine start-up configuration */
#define BMI3_STARTUP_CONFIG_0_MASK UINT16_C(0x0FFFF)

/*! Step counter value word-0 (low word) */
#define BMI3_STEP_COUNTER_OUT_0_MASK UINT16_C(0x0FFFF)

