luoyiliang/xiao-esp32s3-sense-lab/vendor/DFRobot_BMI323-patched/src/bmi3_defs.h
/*! Before feature engine enable: Feature engine start-up configuration */
#define BMI3_STARTUP_CONFIG_1_MASK UINT16_C(0x0FFFF)

/*! Step counter value word-1 (high word) */
#define BMI3_STEP_COUNTER_OUT_1_MASK UINT16_C(0x0FFFF)

/*! On read: data has been written by the feature engine On write: data written by the host shall be sent to the feature
 * engine. */
#define BMI3_FEATURE_IO_STATUS_MASK UINT16_C(0x0001)

/*! Current fill level of FIFO buffer
 * An empty FIFO corresponds to 0x000. The word counter may be reset by reading out all frames from the FIFO buffer or
 * when the FIFO is reset through fifo_flush. The word counter is updated each time a complete frame was read or
 * written. */
#define BMI3_FIFO_FILL_LEVEL_MASK UINT16_C(0x07FF)

/*! FIFO read data (16 bits)
 * Data format depends on the setting of register FIFO_CONF. The FIFO data are organized in frames. The new data flag is
 * preserved. Read burst access must be used, the address will not increment when the read burst reads at the address of
 * FIFO_DATA. When a frame is only partially read out it is retransmitted including the header at the next readout. */
#define BMI3_FIFO_DATA_MASK UINT16_C(0x0FFFF)

/*! ODR in Hz */
#define BMI3_ACC_ODR_MASK UINT16_C(0x000F)

/*! Full scale, Resolution */
#define BMI3_ACC_RANGE_MASK UINT16_C(0x0070)
#define BMI3_ACC_RANGE_POS  UINT8_C(4)

/*! The Accel bandwidth coefficient defines the 3 dB cutoff frequency in relation to the ODR */
#define BMI3_ACC_BW_MASK UINT16_C(0x0080)
#define BMI3_ACC_BW_POS  UINT8_C(7)

/*! Number of samples to be averaged */
#define BMI3_ACC_AVG_NUM_MASK UINT16_C(0x0700)
#define BMI3_ACC_AVG_NUM_POS  UINT8_C(8)

/*! Defines mode of operation for Accelerometer. DO NOT COPY OPERATION DESCRIPTION TO CUSTOMER SPEC! */
#define BMI3_ACC_MODE_MASK UINT16_C(0x7000)
#define BMI3_ACC_MODE_POS  UINT8_C(12)

/*! ODR in Hz */
#define BMI3_GYR_ODR_MASK UINT16_C(0x000F)

/*! Full scale, Resolution */
#define BMI3_GYR_RANGE_MASK UINT16_C(0x0070)
#define BMI3_GYR_RANGE_POS  UINT8_C(4)

/*! The Gyroscope bandwidth coefficient defines the 3 dB cutoff frequency in relation to the ODR */
#define BMI3_GYR_BW_MASK UINT16_C(0x0080)
#define BMI3_GYR_BW_POS  UINT8_C(7)

/*! Number of samples to be averaged */
#define BMI3_GYR_AVG_NUM_MASK UINT16_C(0x0700)
#define BMI3_GYR_AVG_NUM_POS  UINT8_C(8)

/*! Defines mode of operation for Gyroscope.DO NOT COPY OPERATION DESCRIPTION TO CUSTOMER SPEC! */
#define BMI3_GYR_MODE_MASK UINT16_C(0x7000)
#define BMI3_GYR_MODE_POS  UINT8_C(12)

/*! ODR in Hz */
#define BMI3_ALT_ACC_ODR_MASK UINT16_C(0x000F)

/*! Number of samples to be averaged */
#define BMI3_ALT_ACC_AVG_NUM_MASK UINT16_C(0x0700)
#define BMI3_ALT_ACC_AVG_NUM_POS  UINT8_C(8)

/*! Defines mode of operation for Accelerometer. DO NOT COPY OPERATION DESCRIPTION TO CUSTOMER SPEC! */
#define BMI3_ALT_ACC_MODE_MASK UINT16_C(0x7000)
#define BMI3_ALT_ACC_MODE_POS  UINT8_C(12)

/*! ODR in Hz */
#define BMI3_ALT_GYR_ODR_MASK UINT16_C(0x000F)

/*! Number of samples to be averaged */
#define BMI3_ALT_GYR_AVG_NUM_MASK UINT16_C(0x0700)
#define BMI3_ALT_GYR_AVG_NUM_POS  UINT8_C(8)

/*! Defines mode of operation for Gyroscope.DO NOT COPY OPERATION DESCRIPTION TO CUSTOMER SPEC! */
#define BMI3_ALT_GYR_MODE_MASK UINT16_C(0x7000)
#define BMI3_ALT_GYR_MODE_POS  UINT8_C(12)

/*! Enables switching possibility to alternate configuration for accel */
#define BMI3_ALT_ACC_EN_MASK UINT16_C(0x0001)

/*! Enables switching possibility to alternate configuration for gyro */
#define BMI3_ALT_GYR_EN_MASK UINT16_C(0x0010)
#define BMI3_ALT_GYR_EN_POS  UINT8_C(4)

/*! If enabled, any write to ACC_CONF or GYR_CONF will instanly switch back to associated user configuration */
#define BMI3_ALT_RST_CONF_WRITE_EN_MASK UINT16_C(0x0100)
#define BMI3_ALT_RST_CONF_WRITE_EN_POS  UINT8_C(8)

/*! Accel is using ALT_ACC_CONF if set; ACC_CONF otherwise */
#define BMI3_ALT_ACC_ACTIVE_MASK UINT16_C(0x0001)

/*! Gyro is using ALT_GYR_CONF if set; GYR_CONF otherwise */
#define BMI3_ALT_GYR_ACTIVE_MASK UINT16_C(0x0010)
#define BMI3_ALT_GYR_ACTIVE_POS  UINT8_C(4)

/*! Trigger an interrupt when FIFO contains fifo_watermark words */
#define BMI3_FIFO_WATERMARK_MASK UINT16_C(0x03FF)

/*! Stop writing samples into fifo when fifo is full */
#define BMI3_FIFO_STOP_ON_FULL_MASK UINT16_C(0x0001)

/*! Store Sensortime data in FIFO */
#define BMI3_FIFO_TIME_EN_MASK UINT16_C(0x0100)
#define BMI3_FIFO_TIME_EN_POS  UINT8_C(8)

/*! Store Accelerometer data in FIFO (all 3 axes) */
#define BMI3_FIFO_ACC_EN_MASK UINT16_C(0x0200)
#define BMI3_FIFO_ACC_EN_POS  UINT8_C(9)

/*! Store Gyroscope data in FIFO (all 3 axes) */
#define BMI3_FIFO_GYR_EN_MASK UINT16_C(0x0400)
#define BMI3_FIFO_GYR_EN_POS  UINT8_C(10)

/*! Store temperature data in FIFO */
#define BMI3_FIFO_TEMP_EN_MASK UINT16_C(0x0800)
#define BMI3_FIFO_TEMP_EN_POS  UINT8_C(11)

/*! Clear all fifo data; do not touch configuration. */
#define BMI3_FIFO_FLUSH_MASK UINT16_C(0x0001)

/*! Configure level of INT1 pin */
#define BMI3_INT1_LVL_MASK UINT16_C(0x0001)

/*! Configure behavior of INT1 pin */
#define BMI3_INT1_OD_MASK UINT16_C(0x0002)
#define BMI3_INT1_OD_POS  UINT8_C(1)

/*! Output enable for INT1 pin */
#define BMI3_INT1_OUTPUT_EN_MASK UINT16_C(0x0004)
#define BMI3_INT1_OUTPUT_EN_POS  UINT8_C(2)

/*! Configure level of INT2 pin */
#define BMI3_INT2_LVL_MASK UINT16_C(0x0100)
#define BMI3_INT2_LVL_POS  UINT8_C(8)

/*! Configure behavior of INT2 pin */
#define BMI3_INT2_OD_MASK UINT16_C(0x0200)
#define BMI3_INT2_OD_POS  UINT8_C(9)

/*! Output enable for INT2 pin */
#define BMI3_INT2_OUTPUT_EN_MASK UINT16_C(0x0400)
#define BMI3_INT2_OUTPUT_EN_POS  UINT8_C(10)

/*! Mask definitions for interrupt pin configuration */
#define BMI3_INT_LATCH_MASK UINT16_C(0x0001)

/*! Map no-motion output to either INT1 or INT2 or IBI */
#define BMI3_NO_MOTION_OUT_MASK UINT16_C(0x0003)

/*! Map any-motion output to either INT1 or INT2 or IBI */
#define BMI3_ANY_MOTION_OUT_MASK UINT16_C(0x000C)
#define BMI3_ANY_MOTION_OUT_POS  UINT8_C(2)

