luoyiliang/xiao-esp32s3-sense-lab/vendor/DFRobot_BMI323-patched/src/bmi3_defs.h
/*! Map flat output to either INT1 or INT2 or IBI */
#define BMI3_FLAT_OUT_MASK UINT16_C(0x0030)
#define BMI3_FLAT_OUT_POS  UINT8_C(4)

/*! Map orientation output to either INT1 or INT2 or IBI */
#define BMI3_ORIENTATION_OUT_MASK UINT8_C(0x00C0)
#define BMI3_ORIENTATION_OUT_POS  UINT8_C(6)

/*! Map step_detector output to either INT1 or INT2 or IBI */
#define BMI3_STEP_DETECTOR_OUT_MASK UINT8_C(0x0300)
#define BMI3_STEP_DETECTOR_OUT_POS  UINT8_C(8)

/*! Map step_counter watermark output to either INT1 or INT2 or IBI */
#define BMI3_STEP_COUNTER_OUT_MASK UINT8_C(0x0C00)
#define BMI3_STEP_COUNTER_OUT_POS  UINT8_C(10)

/*! Map sigmotion output to either INT1 or INT2 or IBI */
#define BMI3_SIG_MOTION_OUT_MASK UINT16_C(0x3000)
#define BMI3_SIG_MOTION_OUT_POS  UINT8_C(12)

/*! Map tilt output to either INT1 or INT2 or IBI */
#define BMI3_TILT_OUT_MASK UINT16_C(0xC000)
#define BMI3_TILT_OUT_POS  UINT8_C(14)

/*! Map tap output to either INT1 or INT2 or IBI */
#define BMI3_TAP_OUT_MASK UINT16_C(0x0003)
#define BMI3_TAP_OUT_POS  UINT8_C(0)

/*! Map i3c output to either INT1 or INT2 or IBI */
#define BMI3_I3C_OUT_MASK UINT16_C(0x000C)
#define BMI3_I3C_OUT_POS  UINT8_C(2)

/*! Map feature engine's error or status change to either INT1 or INT2 or IBI */
#define BMI3_ERR_STATUS_MASK UINT16_C(0x0030)
#define BMI3_ERR_STATUS_POS  UINT8_C(4)

/*! Map temperature data ready interrupt to either INT1 or INT2 or IBI */
#define BMI3_TEMP_DRDY_INT_MASK UINT16_C(0x00C0)
#define BMI3_TEMP_DRDY_INT_POS  UINT8_C(6)

/*! Map gyro data ready interrupt to either INT1 or INT2 or IBI */
#define BMI3_GYR_DRDY_INT_MASK UINT16_C(0x0300)
#define BMI3_GYR_DRDY_INT_POS  UINT8_C(8)

/*! Map accel data ready interrupt to either INT1 or INT2 or IBI */
#define BMI3_ACC_DRDY_INT_MASK UINT16_C(0x0C00)
#define BMI3_ACC_DRDY_INT_POS  UINT8_C(10)

/*! Map FIFO watermark interrupt to either INT1 or INT2 or IBI */
#define BMI3_FIFO_WATERMARK_INT_MASK UINT16_C(0x3000)
#define BMI3_FIFO_WATERMARK_INT_POS  UINT8_C(12)

/*! Map FIFO full interrupt to either INT1 or INT2 or IBI */
#define BMI3_FIFO_FULL_INT_MASK UINT16_C(0xC000)
#define BMI3_FIFO_FULL_INT_POS  UINT8_C(14)

/*! Enable or disable the feature engine. Note: a soft-reset is required to re-enable the feature engine. */
#define BMI3_ENGINE_EN_MASK UINT16_C(0x0001)

/*! Start address for the feature data, that is feature configurations and extended feature output. */
#define BMI3_DATA_ADDRESS_MASK UINT16_C(0x07FF)

/*! Data port for DMA transfers. */
#define BMI3_DATA_TX_VALUE_MASK UINT16_C(0xFFFF)

/*! Out of bounds error. Cleared on next TX. */
#define BMI3_DATA_OUTOFBOUND_ERR_MASK UINT16_C(0x0001)

/*! DMA is ready to use. If this bit is 0, DMA access will not work. */
#define BMI3_DATA_TX_READY_MASK UINT16_C(0x0002)
#define BMI3_DATA_TX_READY_POS  UINT8_C(1)

/*! Feature engine is in sleep/halt state (will be reset after read) */
#define BMI3_SLEEP_MASK UINT16_C(0x0001)

/*! Transfer of data to or from the feature engine is ongoing. */
#define BMI3_OVERLOAD_MASK UINT16_C(0x0002)
#define BMI3_OVERLOAD_POS  UINT8_C(1)

/*! DMA controller has started DMA and DMA transactions are ongoing */
#define BMI3_DATA_TX_ACTIVE_MASK UINT16_C(0x0008)
#define BMI3_DATA_TX_ACTIVE_POS  UINT8_C(3)

/*! Feature engine was disabled by the host. Perform a soft-reset to re-enable the feature engine. */
#define BMI3_DISABLED_BY_HOST_MASK UINT16_C(0x0010)
#define BMI3_DISABLED_BY_HOST_POS  UINT8_C(4)

/*! The feature engine did not acknowledge its internal watchdog in time. Perform a soft-reset to re-enable the feature
 * engine. */
#define BMI3_WATCHDOG_NOT_ACK_MASK UINT16_C(0x0020)
#define BMI3_WATCHDOG_NOT_ACK_POS  UINT8_C(5)

/*! Output value of the orientation detection feature. Value after device initialization is 0b00 i.e. Portrait upright
 * */
#define BMI3_ORIENTATION_PORTRAIT_LANDSCAPE_MASK UINT16_C(0x0003)

/*! Output value of face down face up orientation (only if ud_en is enabled). Value after device initialization is 0b0
 * i.e. Face up */
#define BMI3_ORIENTATION_FACEUP_DOWN_MASK UINT16_C(0x0004)
#define BMI3_ORIENTATION_FACEUP_DOWN_POS  UINT8_C(2)

/*! Single tap detected */
#define BMI3_S_TAP_MASK UINT16_C(0x0008)
#define BMI3_S_TAP_POS  UINT8_C(3)

/*! Double tap detected */
#define BMI3_D_TAP_MASK UINT16_C(0x0010)
#define BMI3_D_TAP_POS  UINT8_C(4)

/*! Triple tap detected */
#define BMI3_T_TAP_MASK UINT16_C(0x0020)
#define BMI3_T_TAP_POS  UINT8_C(5)

/*! Pull down behavior control */
#define BMI3_ANAIO_PDN_DIS UINT16_C(0x0001)

/*! Mask definitions for SPI read/write address */
#define BMI3_SPI_RD_MASK UINT16_C(0x80)
#define BMI3_SPI_WR_MASK UINT16_C(0x7F)

/*! Enable SPI PIN3 mode. Default is PIN4 mode. */
#define BMI3_SPI3_EN_MASK UINT16_C(0x0001)

/*! Generic output pad drive strength primary interface, 0: weakest; 7: strongest */
#define BMI3_IF_DRV_MASK UINT16_C(0x0007)

/*! SDX I2C control bit - increase drive strength */
#define BMI3_IF_I2C_BOOST_MASK UINT16_C(0x0008)
#define BMI3_IF_I2C_BOOST_POS  UINT8_C(3)

/*! Select timer period for I2C Watchdog */
#define BMI3_WATCHDOG_TIMER_SEL_MASK UINT16_C(0x0001)

/*! I2C Watchdog at the SDI pin in I2C interface mode */
#define BMI3_WATCHDOG_TIMER_EN_MASK UINT16_C(0x0002)
#define BMI3_WATCHDOG_TIMER_EN_POS  UINT8_C(1)

/*! ODR clock deviation */
#define BMI3_ODR_DEVIATION_MASK UINT16_C(0x001F)

/*! Data path register for the temperature independent accelerometer re-scale of axis z */
#define BMI3_ACC_DP_DGAIN_X_MASK UINT16_C(0x00FF)

/*! Data path register for the temperature independent accelerometer re-scale of axis z */
#define BMI3_ACC_DP_DGAIN_Y_MASK UINT16_C(0x00FF)

/*! Data path register for the temperature independent accelerometer re-scale of axis z */
#define BMI3_ACC_DP_DGAIN_Z_MASK UINT16_C(0x00FF)

/*! Data path register for the temperature independent accelerometer offset of axis x */
#define BMI3_GYR_DP_OFF_X_MASK UINT16_C(0x03FF)

/*! Data path register for the temperature independent accelerometer offset of axis y */
#define BMI3_GYR_DP_DGAIN_X_MASK UINT16_C(0x007F)

/*! Data path register for the temperature independent accelerometer offset of axis y */
#define BMI3_GYR_DP_OFF_Y_MASK UINT16_C(0x03FF)

/*! Data path register for the temperature independent accelerometer re-scale of axis z */
#define BMI3_GYR_DP_DGAIN_Y_MASK UINT16_C(0x007F)

/*! Data path register for the temperature independent accelerometer offset of axis z */
#define BMI3_GYR_DP_OFF_Z_MASK UINT16_C(0x03FF)

/*! Data path register for the temperature independent accelerometer re-scale of axis z */
#define BMI3_GYR_DP_DGAIN_Z_MASK UINT16_C(0x007F)

/*! I3C Timing Control Sync TPH Register */
#define BMI3_I3C_TC_SYNC_TPH_MASK UINT16_C(0xFFFF)

/*! I3C Timing Control Sync TU Register */
#define BMI3_I3C_TC_SYNC_TU_MASK UINT16_C(0x00FF)

/*! I3C Timing Control Sync ODR Register */
#define BMI3_I3C_TC_SYNC_ODR_MASK UINT16_C(0x00FF)

/*! Available commands (Note: Register will always return 0x00 as read result) */
#define BMI3_CMD_MASK UINT16_C(0xFFFF)

/*! Value one address mask and bit position */
#define BMI3_VALUE_1_MASK UINT16_C(0x001F)

