luoyiliang/xiao-esp32s3-sense-lab/vendor/DFRobot_BMI323-patched/src/bmi3_defs.h
/*! Value two address mask and bit position */
#define BMI3_VALUE_2_MASK UINT16_C(0xC000)
#define BMI3_VALUE_2_POS  UINT8_C(14)

/*! Feature engine enable mask */
#define BMI3_FEATURE_ENGINE_ENABLE_MASK UINT16_C(0X0001)

#define BMI3_SC_ST_STATUS_MASK UINT8_C(0x10)
#define BMI3_SC_ST_RESULT_MASK UINT8_C(0x40)

#define BMI3_ST_ACC_X_OK_MASK     UINT8_C(0x01)
#define BMI3_ST_ACC_Y_OK_MASK     UINT8_C(0x02)
#define BMI3_ST_ACC_Z_OK_MASK     UINT8_C(0x04)
#define BMI3_ST_GYR_X_OK_MASK     UINT8_C(0x08)
#define BMI3_ST_GYR_Y_OK_MASK     UINT8_C(0x10)
#define BMI3_ST_GYR_Z_OK_MASK     UINT8_C(0x20)
#define BMI3_ST_GYR_DRIVE_OK_MASK UINT8_C(0x40)

#define BMI3_ST_ACC_X_OK_POS     UINT8_C(0)
#define BMI3_ST_ACC_Y_OK_POS     UINT8_C(1)
#define BMI3_ST_ACC_Z_OK_POS     UINT8_C(2)
#define BMI3_ST_GYR_X_OK_POS     UINT8_C(3)
#define BMI3_ST_GYR_Y_OK_POS     UINT8_C(4)
#define BMI3_ST_GYR_Z_OK_POS     UINT8_C(5)
#define BMI3_ST_GYR_DRIVE_OK_POS UINT8_C(6)

#define BMI3_ST_DELAY UINT16_C(35000)
#define BMI3_SC_DELAY UINT16_C(43000)

/*! Macros to define values of BMI3 axis and its sign for re-map settings */
#define BMI3_MAP_XYZ_AXIS UINT8_C(0x00)
#define BMI3_MAP_YXZ_AXIS UINT8_C(0x01)
#define BMI3_MAP_XZY_AXIS UINT8_C(0x02)
#define BMI3_MAP_ZXY_AXIS UINT8_C(0x03)
#define BMI3_MAP_YZX_AXIS UINT8_C(0x04)
#define BMI3_MAP_ZYX_AXIS UINT8_C(0x05)
#define BMI3_MAP_POSITIVE UINT8_C(0x00)
#define BMI3_MAP_NEGATIVE UINT8_C(0x01)

/*! Remap Axes */
#define BMI3_XYZ_AXIS_MASK    UINT8_C(0x07)
#define BMI3_X_AXIS_SIGN_MASK UINT8_C(0x08)
#define BMI3_Y_AXIS_SIGN_MASK UINT8_C(0x10)
#define BMI3_Z_AXIS_SIGN_MASK UINT8_C(0x20)

/*! Bit position definitions of BMI3 axis re-mapping */
#define BMI3_X_AXIS_SIGN_POS UINT8_C(3)
#define BMI3_Y_AXIS_SIGN_POS UINT8_C(4)
#define BMI3_Z_AXIS_SIGN_POS UINT8_C(5)

/*! Feature interrupt status bit values */
#define BMI3_INT_STATUS_NO_MOTION     UINT16_C(0x0001)
#define BMI3_INT_STATUS_ANY_MOTION    UINT16_C(0x0002)
#define BMI3_INT_STATUS_FLAT          UINT16_C(0x0004)
#define BMI3_INT_STATUS_ORIENTATION   UINT16_C(0x0008)
#define BMI3_INT_STATUS_STEP_DETECTOR UINT16_C(0x0010)
#define BMI3_INT_STATUS_STEP_COUNTER  UINT16_C(0x0020)
#define BMI3_INT_STATUS_SIG_MOTION    UINT16_C(0x0040)
#define BMI3_INT_STATUS_TILT          UINT16_C(0x0080)
#define BMI3_INT_STATUS_TAP           UINT16_C(0x0100)
#define BMI3_INT_STATUS_I3C           UINT16_C(0x0200)
#define BMI3_INT_STATUS_ERR           UINT16_C(0x0400)
#define BMI3_INT_STATUS_TEMP_DRDY     UINT16_C(0x0800)
#define BMI3_INT_STATUS_GYR_DRDY      UINT16_C(0x1000)
#define BMI3_INT_STATUS_ACC_DRDY      UINT16_C(0x2000)
#define BMI3_INT_STATUS_FWM           UINT16_C(0x4000)
#define BMI3_INT_STATUS_FFULL         UINT16_C(0x8000)

/*! IBI status bit values */
#define BMI3_IBI_STATUS_NO_MOTION     UINT16_C(0x0001)
#define BMI3_IBI_STATUS_ANY_MOTION    UINT16_C(0x0002)
#define BMI3_IBI_STATUS_FLAT          UINT16_C(0x0004)
#define BMI3_IBI_STATUS_ORIENTATION   UINT16_C(0x0008)
#define BMI3_IBI_STATUS_STEP_DETECTOR UINT16_C(0x0010)
#define BMI3_IBI_STATUS_STEP_COUNTER  UINT16_C(0x0020)
#define BMI3_IBI_STATUS_SIG_MOTION    UINT16_C(0x0040)
#define BMI3_IBI_STATUS_TILT          UINT16_C(0x0080)
#define BMI3_IBI_STATUS_TAP           UINT16_C(0x0100)
#define BMI3_IBI_STATUS_I3C           UINT16_C(0x0200)
#define BMI3_IBI_STATUS_ERR_STATUS    UINT16_C(0x0400)
#define BMI3_IBI_STATUS_TEMP_DRDY     UINT16_C(0x0800)
#define BMI3_IBI_STATUS_GYR_DRDY      UINT16_C(0x1000)
#define BMI3_IBI_STATUS_ACC_DRDY      UINT16_C(0x2000)
#define BMI3_IBI_STATUS_FWM           UINT16_C(0x4000)
#define BMI3_IBI_STATUS_FFULL         UINT16_C(0x8000)

/******************************************************************************/
/*!  Mask definitions for feature interrupts configuration  */
/******************************************************************************/
#define BMI3_ANY_NO_SLOPE_THRESHOLD_MASK UINT16_C(0x0FFF)

#define BMI3_ANY_NO_ACC_REF_UP_MASK UINT16_C(0x1000)
#define BMI3_ANY_NO_ACC_REF_UP_POS  UINT8_C(12)

#define BMI3_ANY_NO_HYSTERESIS_MASK UINT16_C(0x03FF)

#define BMI3_ANY_NO_DURATION_MASK UINT16_C(0x1FFF)

#define BMI3_ANY_NO_WAIT_TIME_MASK UINT16_C(0xE000)
#define BMI3_ANY_NO_WAIT_TIME_POS  UINT8_C(13)

/*! Bit mask definitions for BMI3 flat feature configuration */
#define BMI3_FLAT_THETA_MASK       UINT16_C(0x003F)
#define BMI3_FLAT_BLOCKING_MASK    UINT16_C(0x00C0)
#define BMI3_FLAT_HOLD_TIME_MASK   UINT16_C(0xFF00)
#define BMI3_FLAT_SLOPE_THRES_MASK UINT16_C(0x00FF)
#define BMI3_FLAT_HYST_MASK        UINT16_C(0XFF00)

/*! Bit position definitions for BMI3 flat feature configuration */
#define BMI3_FLAT_BLOCKING_POS  UINT8_C(0x06)
#define BMI3_FLAT_HOLD_TIME_POS UINT8_C(0x08)
#define BMI3_FLAT_HYST_POS      UINT8_C(0x08)

/*! Bit mask definitions for BMI3 significant motion feature configuration */
#define BMI3_SIG_BLOCK_SIZE_MASK UINT16_C(0xFFFF)

#define BMI3_SIG_P2P_MIN_MASK UINT16_C(0x03FF)

#define BMI3_SIG_MCR_MIN_MASK UINT16_C(0xFC00)
#define BMI3_SIG_MCR_MIN_POS  UINT8_C(10)

#define BMI3_SIG_P2P_MAX_MASK UINT16_C(0x03FF)

#define BMI3_MCR_MAX_MASK UINT16_C(0xFC00)
#define BMI3_MCR_MAX_POS  UINT8_C(10)

/*! Bit mask definitions for BMI3 tilt feature configuration */
#define BMI3_TILT_SEGMENT_SIZE_MASK UINT16_C(0x00FF)

#define BMI3_TILT_MIN_TILT_ANGLE_MASK UINT16_C(0xFF00)
#define BMI3_TILT_MIN_TILT_ANGLE_POS  UINT8_C(8)

#define BMI3_TILT_BETA_ACC_MEAN_MASK UINT16_C(0xFFFF)

/*! Bit mask definitions for BMI3 orientation feature configuration */
#define BMI3_ORIENT_UD_EN_MASK       UINT16_C(0x0001)
#define BMI3_ORIENT_MODE_MASK        UINT16_C(0x0006)
#define BMI3_ORIENT_BLOCKING_MASK    UINT16_C(0x0018)
#define BMI3_ORIENT_THETA_MASK       UINT16_C(0x07E0)
#define BMI3_ORIENT_HOLD_TIME_MASK   UINT16_C(0XF800)
#define BMI3_ORIENT_SLOPE_THRES_MASK UINT16_C(0X00FF)
#define BMI3_ORIENT_HYST_MASK        UINT16_C(0XFF00)

/*! Bit position definitions for BMI3 orientation feature configuration */
#define BMI3_ORIENT_MODE_POS      UINT8_C(1)
#define BMI3_ORIENT_BLOCKING_POS  UINT8_C(3)
#define BMI3_ORIENT_THETA_POS     UINT8_C(5)
#define BMI3_ORIENT_HOLD_TIME_POS UINT8_C(11)
#define BMI3_ORIENT_HYST_POS      UINT8_C(8)

/*! Bit position definitions for BMI3 step counter feature configuration */
#define BMI3_STEP_WATERMARK_MASK UINT16_C(0x3FF)

#define BMI3_STEP_RESET_COUNTER_MASK UINT16_C(0x0400)
#define BMI3_STEP_RESET_COUNTER_POS  UINT8_C(10)

#define BMI3_STEP_ENV_MIN_DIST_UP_MASK UINT16_C(0xFFFF)

