luoyiliang/xiao-esp32s3-sense-lab/vendor/DFRobot_BMI323-patched/src/bmi3_defs.h
#define BMI3_STEP_ENV_COEF_UP_MASK UINT16_C(0xFFFF)

#define BMI3_STEP_ENV_MIN_DIST_DOWN_MASK UINT16_C(0xFFFF)

#define BMI3_STEP_ENV_COEF_DOWN_MASK UINT16_C(0xFFFF)

#define BMI3_STEP_MEAN_VAL_DECAY_MASK UINT16_C(0xFFFF)

#define BMI3_STEP_MEAN_STEP_DUR_MASK UINT16_C(0xFFFF)

#define BMI3_STEP_BUFFER_SIZE_MASK UINT16_C(0x000F)

#define BMI3_STEP_FILTER_CASCADE_ENABLED_MASK UINT16_C(0x0010)
#define BMI3_STEP_FILTER_CASCADE_ENABLED_POS  UINT8_C(4)

#define BMI3_STEP_COUNTER_INCREMENT_MASK UINT16_C(0xFFE0)
#define BMI3_STEP_COUNTER_INCREMENT_POS  UINT8_C(5)

#define BMI3_STEP_PEAK_DURATION_MIN_WALKING_MASK UINT16_C(0x00FF)

#define BMI3_STEP_PEAK_DURATION_MIN_RUNNING_MASK UINT16_C(0xFF00)
#define BMI3_STEP_PEAK_DURATION_MIN_RUNNING_POS  UINT8_C(8)

#define BMI3_STEP_ACTIVITY_DETECTION_FACTOR_MASK UINT16_C(0x000F)

#define BMI3_STEP_ACTIVITY_DETECTION_THRESHOLD_MASK UINT16_C(0xFFF0)
#define BMI3_STEP_ACTIVITY_DETECTION_THRESHOLD_POS  UINT8_C(4)

#define BMI3_STEP_DURATION_MAX_MASK UINT16_C(0x00FF)

#define BMI3_STEP_DURATION_WINDOW_MASK UINT16_C(0xFF00)
#define BMI3_STEP_DURATION_WINDOW_POS  UINT8_C(8)

#define BMI3_STEP_DURATION_PP_ENABLED_MASK UINT16_C(0x0001)

#define BMI3_STEP_DURATION_THRESHOLD_MASK UINT16_C(0x000E)
#define BMI3_STEP_DURATION_THRESHOLD_POS  UINT8_C(1)

#define BMI3_STEP_MEAN_CROSSING_PP_ENABLED_MASK UINT16_C(0x0010)
#define BMI3_STEP_MEAN_CROSSING_PP_ENABLED_POS  UINT8_C(4)

#define BMI3_STEP_MCR_THRESHOLD_MASK UINT16_C(0x03E0)
#define BMI3_STEP_MCR_THRESHOLD_POS  UINT8_C(5)

/*! Bit mask definitions for BMI3 tap feature configuration */
#define BMI3_TAP_AXIS_SEL_MASK              UINT16_C(0x0003)
#define BMI3_TAP_WAIT_FR_TIME_OUT_MASK      UINT16_C(0x0004)
#define BMI3_TAP_MAX_PEAKS_MASK             UINT16_C(0x0038)
#define BMI3_TAP_MODE_MASK                  UINT16_C(0x00C0)
#define BMI3_TAP_PEAK_THRES_MASK            UINT16_C(0X03FF)
#define BMI3_TAP_MAX_GEST_DUR_MASK          UINT16_C(0XFC00)
#define BMI3_TAP_MAX_DUR_BW_PEAKS_MASK      UINT16_C(0X000F)
#define BMI3_TAP_SHOCK_SETT_DUR_MASK        UINT16_C(0X00F0)
#define BMI3_TAP_MIN_QUITE_DUR_BW_TAPS_MASK UINT16_C(0X0F00)
#define BMI3_TAP_QUITE_TIME_AFTR_GEST_MASK  UINT16_C(0XF000)

/*! Bit position definitions for BMI3 tap feature configuration */
#define BMI3_TAP_WAIT_FR_TIME_OUT_POS      UINT8_C(0x02)
#define BMI3_TAP_MAX_PEAKS_POS             UINT8_C(0x03)
#define BMI3_TAP_MODE_POS                  UINT8_C(0x06)
#define BMI3_TAP_MAX_GEST_DUR_POS          UINT8_C(0x0A)
#define BMI3_TAP_SHOCK_SETT_DUR_POS        UINT8_C(0x04)
#define BMI3_TAP_MIN_QUITE_DUR_BW_TAPS_POS UINT8_C(0x08)
#define BMI3_TAP_QUITE_TIME_AFTR_GEST_POS  UINT8_C(0x0C)

#define BMI3_TAP_DET_STATUS_SINGLE UINT16_C(0X0008)
#define BMI3_TAP_DET_STATUS_DOUBLE UINT16_C(0X0010)
#define BMI3_TAP_DET_STATUS_TRIPLE UINT16_C(0X0020)

/*! Bit mask definitions for BMI3 accel gyro user gain and offset */
#define BMI3_ACC_OFF_GAIN_RESET_MASK UINT16_C(0x0001)
#define BMI3_GYR_OFF_GAIN_RESET_MASK UINT16_C(0x0002)
#define BMI3_ACC_USR_OFF_X_MASK      UINT16_C(0x3FFF)
#define BMI3_ACC_USR_OFF_Y_MASK      UINT16_C(0x3FFF)
#define BMI3_ACC_USR_OFF_Z_MASK      UINT16_C(0x3FFF)
#define BMI3_ACC_USR_GAIN_X_MASK     UINT16_C(0x00FF)
#define BMI3_ACC_USR_GAIN_Y_MASK     UINT16_C(0x00FF)
#define BMI3_ACC_USR_GAIN_Z_MASK     UINT16_C(0x00FF)
#define BMI3_GYR_USR_OFF_X_MASK      UINT16_C(0x03FF)
#define BMI3_GYR_USR_OFF_Y_MASK      UINT16_C(0x03FF)
#define BMI3_GYR_USR_OFF_Z_MASK      UINT16_C(0x03FF)
#define BMI3_GYR_USR_GAIN_X_MASK     UINT16_C(0x007F)
#define BMI3_GYR_USR_GAIN_Y_MASK     UINT16_C(0x007F)
#define BMI3_GYR_USR_GAIN_Z_MASK     UINT16_C(0x007F)

/*! Data path register for the temperature independent accelerometer offset of axis x */
#define BMI3_ACC_DP_OFF_XYZ_13_BIT_MASK UINT16_C(0x1FFF)
#define BMI3_ACC_DP_OFF_XYZ_14_BIT_MASK UINT16_C(0x3FFF)

/*! Bit position definitions for BMI3 accel gyro user gain and offset */
#define BMI3_GYR_OFF_GAIN_RESET_POS UINT8_C(1)

/******************************************************************************/
/*! BMI3 sensor data bytes */
/******************************************************************************/
#define BMI3_ACC_NUM_BYTES           UINT8_C(20)
#define BMI3_GYR_NUM_BYTES           UINT8_C(14)
#define BMI3_CRT_CONFIG_FILE_SIZE    UINT16_C(2048)
#define BMI3_FEAT_SIZE_IN_BYTES      UINT8_C(16)
#define BMI3_ACC_CONFIG_LENGTH       UINT8_C(2)
#define BMI3_NUM_BYTES_I3C_SYNC_ACC  UINT8_C(16)
#define BMI3_NUM_BYTES_I3C_SYNC_GYR  UINT8_C(10)
#define BMI3_NUM_BYTES_I3C_SYNC_TEMP UINT8_C(4)

/******************************************************************************/
/*!        Accelerometer Macro Definitions               */
/******************************************************************************/
/*!  Accelerometer Bandwidth parameters */
#define BMI3_ACC_AVG1  UINT8_C(0x00)
#define BMI3_ACC_AVG2  UINT8_C(0x01)
#define BMI3_ACC_AVG4  UINT8_C(0x02)
#define BMI3_ACC_AVG8  UINT8_C(0x03)
#define BMI3_ACC_AVG16 UINT8_C(0x04)
#define BMI3_ACC_AVG32 UINT8_C(0x05)
#define BMI3_ACC_AVG64 UINT8_C(0x06)

/*! Accelerometer Output Data Rate */
#define BMI3_ACC_ODR_0_78HZ  UINT8_C(0x01)
#define BMI3_ACC_ODR_1_56HZ  UINT8_C(0x02)
#define BMI3_ACC_ODR_3_125HZ UINT8_C(0x03)
#define BMI3_ACC_ODR_6_25HZ  UINT8_C(0x04)
#define BMI3_ACC_ODR_12_5HZ  UINT8_C(0x05)
#define BMI3_ACC_ODR_25HZ    UINT8_C(0x06)
#define BMI3_ACC_ODR_50HZ    UINT8_C(0x07)
#define BMI3_ACC_ODR_100HZ   UINT8_C(0x08)
#define BMI3_ACC_ODR_200HZ   UINT8_C(0x09)
#define BMI3_ACC_ODR_400HZ   UINT8_C(0x0A)
#define BMI3_ACC_ODR_800HZ   UINT8_C(0x0B)
#define BMI3_ACC_ODR_1600HZ  UINT8_C(0x0C)
#define BMI3_ACC_ODR_3200HZ  UINT8_C(0x0D)
#define BMI3_ACC_ODR_6400HZ  UINT8_C(0x0E)

/*! Accelerometer G Range */
#define BMI3_ACC_RANGE_2G  UINT8_C(0x00)
#define BMI3_ACC_RANGE_4G  UINT8_C(0x01)
#define BMI3_ACC_RANGE_8G  UINT8_C(0x02)
#define BMI3_ACC_RANGE_16G UINT8_C(0x03)

/*! G values */
/* Macro function to derive the value macro from the range macro */
#define BMI3_GET_RANGE_VAL(range) (range##_VAL)

#define BMI3_ACC_RANGE_2G_VAL  (2.0f)
#define BMI3_ACC_RANGE_4G_VAL  (4.00f)
#define BMI3_ACC_RANGE_8G_VAL  (8.00f)
#define BMI3_ACC_RANGE_16G_VAL (16.00f)

