luoyiliang/xiao-esp32s3-sense-lab/vendor/DFRobot_BMI323-patched/src/bmi3_defs.h
/*! dps values */
/* Macro function to derive the value macro from the range macro */
#define BMI3_GET_DPS_VAL(dps) (dps##_VAL)

#define BMI3_GYR_RANGE_125DPS_VAL  (125.00f)
#define BMI3_GYR_RANGE_250DPS_VAL  (250.00f)
#define BMI3_GYR_RANGE_500DPS_VAL  (500.00f)
#define BMI3_GYR_RANGE_1000DPS_VAL (1000.00f)
#define BMI3_GYR_RANGE_2000DPS_VAL (2000.00f)

/*! Accelerometer mode */
#define BMI3_ACC_MODE_DISABLE   UINT8_C(0x00)
#define BMI3_ACC_MODE_LOW_PWR   UINT8_C(0x03)
#define BMI3_ACC_MODE_NORMAL    UINT8_C(0X04)
#define BMI3_ACC_MODE_HIGH_PERF UINT8_C(0x07)

/*! Accelerometer bandwidth */
#define BMI3_ACC_BW_ODR_HALF    UINT8_C(0)
#define BMI3_ACC_BW_ODR_QUARTER UINT8_C(1)

/* Macros to replace constant values */
#define BMI3_N_SENSE_COUNT_1 UINT8_C(1)
#define BMI3_N_SENSE_COUNT_2 UINT8_C(2)
#define BMI3_N_SENSE_COUNT_3 UINT8_C(3)
#define BMI3_N_SENSE_COUNT_4 UINT8_C(4)
#define BMI3_N_SENSE_COUNT_5 UINT8_C(5)
#define BMI3_N_SENSE_COUNT_6 UINT8_C(6)
#define BMI3_N_SENSE_COUNT_7 UINT8_C(7)

/******************************************************************************/
/*!       Gyroscope Macro Definitions               */
/******************************************************************************/
/*!  Gyroscope Bandwidth parameters */
#define BMI3_GYR_AVG1  UINT8_C(0x00)
#define BMI3_GYR_AVG2  UINT8_C(0x01)
#define BMI3_GYR_AVG4  UINT8_C(0x02)
#define BMI3_GYR_AVG8  UINT8_C(0x03)
#define BMI3_GYR_AVG16 UINT8_C(0x04)
#define BMI3_GYR_AVG32 UINT8_C(0x05)
#define BMI3_GYR_AVG64 UINT8_C(0x06)

/*! Gyroscope Output Data Rate */
#define BMI3_GYR_ODR_0_78HZ  UINT8_C(0x01)
#define BMI3_GYR_ODR_1_56HZ  UINT8_C(0x02)
#define BMI3_GYR_ODR_3_125HZ UINT8_C(0x03)
#define BMI3_GYR_ODR_6_25HZ  UINT8_C(0x04)
#define BMI3_GYR_ODR_12_5HZ  UINT8_C(0x05)
#define BMI3_GYR_ODR_25HZ    UINT8_C(0x06)
#define BMI3_GYR_ODR_50HZ    UINT8_C(0x07)
#define BMI3_GYR_ODR_100HZ   UINT8_C(0x08)
#define BMI3_GYR_ODR_200HZ   UINT8_C(0x09)
#define BMI3_GYR_ODR_400HZ   UINT8_C(0x0A)
#define BMI3_GYR_ODR_800HZ   UINT8_C(0x0B)
#define BMI3_GYR_ODR_1600HZ  UINT8_C(0x0C)
#define BMI3_GYR_ODR_3200HZ  UINT8_C(0x0D)
#define BMI3_GYR_ODR_6400HZ  UINT8_C(0x0E)

/*! Gyroscope DPS Range */
#define BMI3_GYR_RANGE_125DPS  UINT8_C(0x00)
#define BMI3_GYR_RANGE_250DPS  UINT8_C(0x01)
#define BMI3_GYR_RANGE_500DPS  UINT8_C(0x02)
#define BMI3_GYR_RANGE_1000DPS UINT8_C(0x03)
#define BMI3_GYR_RANGE_2000DPS UINT8_C(0x04)

/*! Gyroscope mode */
#define BMI3_GYR_MODE_DISABLE   UINT8_C(0x00)
#define BMI3_GYR_MODE_SUSPEND   UINT8_C(0X01)
#define BMI3_GYR_MODE_LOW_PWR   UINT8_C(0x03)
#define BMI3_GYR_MODE_NORMAL    UINT8_C(0X04)
#define BMI3_GYR_MODE_HIGH_PERF UINT8_C(0x07)

/*! Gyroscope bandwidth */
#define BMI3_GYR_BW_ODR_HALF    UINT8_C(0)
#define BMI3_GYR_BW_ODR_QUARTER UINT8_C(1)

/******************************************************************************/
/*!        Alternate Accelerometer Macro Definitions               */
/******************************************************************************/
/*!  Alternate Accelerometer Bandwidth parameters */
#define BMI3_ALT_ACC_AVG1  UINT8_C(0x00)
#define BMI3_ALT_ACC_AVG2  UINT8_C(0x01)
#define BMI3_ALT_ACC_AVG4  UINT8_C(0x02)
#define BMI3_ALT_ACC_AVG8  UINT8_C(0x03)
#define BMI3_ALT_ACC_AVG16 UINT8_C(0x04)
#define BMI3_ALT_ACC_AVG32 UINT8_C(0x05)
#define BMI3_ALT_ACC_AVG64 UINT8_C(0x06)

/*! Alternate Accelerometer Output Data Rate */
#define BMI3_ALT_ACC_ODR_0_78HZ  UINT8_C(0x01)
#define BMI3_ALT_ACC_ODR_1_56HZ  UINT8_C(0x02)
#define BMI3_ALT_ACC_ODR_3_125HZ UINT8_C(0x03)
#define BMI3_ALT_ACC_ODR_6_25HZ  UINT8_C(0x04)
#define BMI3_ALT_ACC_ODR_12_5HZ  UINT8_C(0x05)
#define BMI3_ALT_ACC_ODR_25HZ    UINT8_C(0x06)
#define BMI3_ALT_ACC_ODR_50HZ    UINT8_C(0x07)
#define BMI3_ALT_ACC_ODR_100HZ   UINT8_C(0x08)
#define BMI3_ALT_ACC_ODR_200HZ   UINT8_C(0x09)
#define BMI3_ALT_ACC_ODR_400HZ   UINT8_C(0x0A)
#define BMI3_ALT_ACC_ODR_800HZ   UINT8_C(0x0B)
#define BMI3_ALT_ACC_ODR_1600HZ  UINT8_C(0x0C)
#define BMI3_ALT_ACC_ODR_3200HZ  UINT8_C(0x0D)
#define BMI3_ALT_ACC_ODR_6400HZ  UINT8_C(0x0E)

/*! Alternate Accelerometer mode */
#define BMI3_ALT_ACC_MODE_DISABLE   UINT8_C(0x00)
#define BMI3_ALT_ACC_MODE_LOW_PWR   UINT8_C(0x03)
#define BMI3_ALT_ACC_MODE_NORMAL    UINT8_C(0X04)
#define BMI3_ALT_ACC_MODE_HIGH_PERF UINT8_C(0x07)

/******************************************************************************/
/*!      Alternate Gyroscope Macro Definitions               */
/******************************************************************************/
/*!  Alternate Gyroscope Bandwidth parameters */
#define BMI3_ALT_GYR_AVG1  UINT8_C(0x00)
#define BMI3_ALT_GYR_AVG2  UINT8_C(0x01)
#define BMI3_ALT_GYR_AVG4  UINT8_C(0x02)
#define BMI3_ALT_GYR_AVG8  UINT8_C(0x03)
#define BMI3_ALT_GYR_AVG16 UINT8_C(0x04)
#define BMI3_ALT_GYR_AVG32 UINT8_C(0x05)
#define BMI3_ALT_GYR_AVG64 UINT8_C(0x06)

/*! Alternate Gyroscope Output Data Rate */
#define BMI3_ALT_GYR_ODR_0_78HZ  UINT8_C(0x01)
#define BMI3_ALT_GYR_ODR_1_56HZ  UINT8_C(0x02)
#define BMI3_ALT_GYR_ODR_3_125HZ UINT8_C(0x03)
#define BMI3_ALT_GYR_ODR_6_25HZ  UINT8_C(0x04)
#define BMI3_ALT_GYR_ODR_12_5HZ  UINT8_C(0x05)
#define BMI3_ALT_GYR_ODR_25HZ    UINT8_C(0x06)
#define BMI3_ALT_GYR_ODR_50HZ    UINT8_C(0x07)
#define BMI3_ALT_GYR_ODR_100HZ   UINT8_C(0x08)
#define BMI3_ALT_GYR_ODR_200HZ   UINT8_C(0x09)
#define BMI3_ALT_GYR_ODR_400HZ   UINT8_C(0x0A)
#define BMI3_ALT_GYR_ODR_800HZ   UINT8_C(0x0B)
#define BMI3_ALT_GYR_ODR_1600HZ  UINT8_C(0x0C)
#define BMI3_ALT_GYR_ODR_3200HZ  UINT8_C(0x0D)
#define BMI3_ALT_GYR_ODR_6400HZ  UINT8_C(0x0E)

/*! Alternate Gyroscope mode */
#define BMI3_ALT_GYR_MODE_DISABLE   UINT8_C(0x00)
#define BMI3_ALT_GYR_MODE_SUSPEND   UINT8_C(0X01)
#define BMI3_ALT_GYR_MODE_LOW_PWR   UINT8_C(0x03)
#define BMI3_ALT_GYR_MODE_NORMAL    UINT8_C(0X04)
#define BMI3_ALT_GYR_MODE_HIGH_PERF UINT8_C(0x07)

/******************************************************************************/
/*!       I3C Macro Definitions               */
/******************************************************************************/

