luoyiliang/xiao-esp32s3-sense-lab/vendor/DFRobot_BMI323-patched/src/bmi3_defs.h
  /*! Defines various sensor data */
  union bmi3_sens_data sens_data;
};

/*!
 * @brief Structure to define accelerometer configuration
 */
struct bmi3_accel_config {
  /*! Output data rate in Hz */
  uint8_t odr;

  /*! Bandwidth parameter */
  uint8_t bwp;

  /*! Filter accel mode */
  uint8_t acc_mode;

  /*! Gravity range */
  uint8_t range;

  /*! Defines the number of samples to be averaged */
  uint8_t avg_num;
};

/*!
 * @brief Structure to define gyroscope configuration
 */
struct bmi3_gyro_config {
  /*! Output data rate in Hz */
  uint8_t odr;

  /*! Bandwidth parameter */
  uint8_t bwp;

  /*! Filter gyro mode */
  uint8_t gyr_mode;

  /*! Gyroscope Range */
  uint8_t range;

  /*! Defines the number of samples to be averaged */
  uint8_t avg_num;
};

/*!
 * @brief Structure to define any-motion configuration
 */
struct bmi3_any_motion_config {
  /*! Duration in 50Hz samples(20msec) */
  uint16_t duration;

  /*! Acceleration slope threshold */
  uint16_t slope_thres;

  /*! Mode of accel reference update */
  uint8_t acc_ref_up;

  /*! Hysteresis for the slope of the acceleration signal */
  uint16_t hysteresis;

  /*! Wait time for clearing the event after slope is below threshold */
  uint16_t wait_time;
};

/*!
 * @brief Structure to define no-motion configuration
 */
struct bmi3_no_motion_config {
  /*! Duration in 50Hz samples(20msec) */
  uint16_t duration;

  /*! Acceleration slope threshold */
  uint16_t slope_thres;

  /*! Mode of accel reference update */
  uint8_t acc_ref_up;

  /*! Hysteresis for the slope of the acceleration signal */
  uint16_t hysteresis;

  /*! Wait time for clearing the event after slope is below threshold */
  uint16_t wait_time;
};

/*!
 * @brief Structure to define sig-motion configuration
 */
struct bmi3_sig_motion_config {
  /*! Block size */
  uint16_t block_size;

  /*! Minimum value of the peak to peak acceleration magnitude */
  uint16_t peak_2_peak_min;

  /*! Minimum number of mean crossing per second in acceleration magnitude */
  uint8_t mcr_min;

  /*! Maximum value of the peak to peak acceleration magnitude */
  uint16_t peak_2_peak_max;

  /*! MAximum number of mean crossing per second in acceleration magnitude */
  uint8_t mcr_max;
};

/*!
 * @brief Structure to define step counter configuration
 */
struct bmi3_step_counter_config {
  /*! Water-mark level */
  uint16_t watermark_level;

  /*! Reset the accumulated step count value */
  uint16_t reset_counter;

  /*! Threshold for upper peak of acceleration magnitude for step detection */
  uint16_t env_min_dist_up;

  /*! Adaptive upper peak threshold decay coefficient */
  uint16_t env_coef_up;

  /*! Threshold for lower peak of acceleration magnitude for step detection */
  uint16_t env_min_dist_down;

  /*! Adaptive lower peak threshold decay coefficient */
  uint16_t env_coef_down;

  /*! Exponential smoothing filter coefficient for computing mean of acceleration magnitude */
  uint16_t mean_val_decay;

  /*! Exponential smoothing filter coefficient for computing mean duration between steps */
  uint16_t mean_step_dur;

  /*! Minimum number of consecutive steps to be detected for updating step count */
  uint16_t step_buffer_size;

  /*! Enable or disable cascading of filters */
  uint16_t filter_cascade_enabled;

  /*! Scale factor for the step count to handle overcounting to undercounting */
  uint16_t step_counter_increment;

  /*! Minimum duration between two consecutive steps while walking */
  uint16_t peak_duration_min_walking;

  /*! Minimum duration between two consecutive steps while running */
  uint16_t peak_duration_min_running;

  /*! Ratio of acceleration magnitude variance during running to walking */
  uint16_t activity_detection_factor;

  /*! Acceleration magnitude variance threshold for activity classification */
  uint16_t activity_detection_thres;

  /*! Maximum duration between two consecutive step occurrence */
  uint16_t step_duration_max;

  /*! Maximum duration since last step where next step shall be detected to add missed step, if any */
  uint16_t step_duration_window;

  /*! Enable or disable post-processing for duration between steps */
  uint16_t step_duration_pp_enabled;

  /*! Scale factor for mean step duration for step processing */
  uint16_t step_duration_thres;

  /*! Enable or disable post-processing of step based on mean crossing */
  uint16_t mean_crossing_pp_enabled;

  /*! Threshold for number of mean crossings between two consecutive steps */
  uint16_t mcr_threshold;
};

/*!
 * @brief Structure to define gyroscope user gain configuration
 */
struct bmi3_gyro_user_gain_config {
  /*! Gain update value for x-axis */
  uint16_t ratio_x;

  /*! Gain update value for y-axis */
  uint16_t ratio_y;

  /*! Gain update value for z-axis */
  uint16_t ratio_z;
};

/*!
 * @brief Structure to define tilt configuration
 */
struct bmi3_tilt_config {
  /*! Duration for which the acceleration vector is averaged to be reference vector */
  uint16_t segment_size;

  /*! Minimum tilt angle */
  uint16_t min_tilt_angle;

  /*! Mean of acceleration vector */
  uint16_t beta_acc_mean;
};

/*!
 * @brief Structure to define orientation configuration
 */
struct bmi3_orientation_config {
  /*! Upside/down detection */
  uint8_t ud_en;

  /*! Symmetrical, high or low Symmetrical */
  uint8_t mode;

  /*! Blocking mode */
  uint8_t blocking;

  /*! Threshold angle */
  uint8_t theta;

  /*! Hold time of device */
  uint8_t hold_time;

  /*! Acceleration hysteresis for orientation detection */
  uint8_t hysteresis;

  /*! Slope threshold */
  uint8_t slope_thres;
};

/*!
 * @brief Structure to define flat configuration
 */
struct bmi3_flat_config {
  /*! Theta angle for flat detection */
  uint16_t theta;

  /*! Blocking mode */
  uint16_t blocking;

  /*! Hysteresis for theta flat detection */
  uint16_t hysteresis;

  /*! Holds the duration in 50Hz samples(20msec) */
  uint16_t hold_time;

  /*! Minimum slope between consecutive acceleration samples to pervent the
     * change of flat status during large movement */
  uint16_t slope_thres;
};

/*!
 * @brief Structure to define tap configuration
 */
struct bmi3_tap_detector_config {
  /*! Axis selection */
  uint8_t axis_sel;

  /*! Wait time */
  uint8_t wait_for_timeout;

  /*! Maximum number of zero crossing expected around a tap */
  uint8_t max_peaks_for_tap;

