luoyiliang/xiao-esp32s3-sense-lab/vendor/DFRobot_BMI323-patched/src/bmi3_defs.h
  /*! Accel dp gain y-axis */
  uint8_t acc_dp_dgain_y;

  /*! Accel dp gain z-axis */
  uint8_t acc_dp_dgain_z;
};

/*!
 * @brief Structure to store gyro dp gain offset values
 */
struct bmi3_gyr_dp_gain_offset {
  /*! Gyro dp offset x-axis */
  uint16_t gyr_dp_off_x;

  /*! Gyro dp offset y-axis */
  uint16_t gyr_dp_off_y;

  /*! Gyro dp offset z-axis */
  uint16_t gyr_dp_off_z;

  /*! Gyro dp gain x-axis */
  uint8_t gyr_dp_dgain_x;

  /*! Gyro dp gain y-axis */
  uint8_t gyr_dp_dgain_y;

  /*! Gyro dp gain z-axis */
  uint8_t gyr_dp_dgain_z;
};

/*!
 * @brief Structure to store accel user gain offset values
 */
struct bmi3_acc_usr_gain_offset {
  /*! Accel user offset x-axis */
  uint16_t acc_usr_off_x;

  /*! Accel user offset y-axis */
  uint16_t acc_usr_off_y;

  /*! Accel user offset z-axis */
  uint16_t acc_usr_off_z;

  /*! Accel user gain x-axis */
  uint8_t acc_usr_gain_x;

  /*! Accel user gain y-axis */
  uint8_t acc_usr_gain_y;

  /*! Accel user gain z-axis */
  uint8_t acc_usr_gain_z;
};

/*!
 * @brief Structure to store gyro user gain offset values
 */
struct bmi3_gyr_usr_gain_offset {
  /*! Gyro user offset x-axis */
  uint16_t gyr_usr_off_x;

  /*! Gyro user offset y-axis */
  uint16_t gyr_usr_off_y;

  /*! Gyro user offset z-axis */
  uint16_t gyr_usr_off_z;

  /*! Gyro user gain x-axis */
  uint8_t gyr_usr_gain_x;

  /*! Gyro user gain y-axis */
  uint8_t gyr_usr_gain_y;

  /*! Gyro user gain z-axis */
  uint8_t gyr_usr_gain_z;
};

/*!
 * @brief Structure to enable an accel axis for FOC
 */
struct bmi3_accel_foc_g_value {
  /*! '0' to disable x axis and '1' to enable x axis */
  uint8_t x;

  /*! '0' to disable y axis and '1' to enable y axis */
  uint8_t y;

  /*! '0' to disable z axis and '1' to enable z axis */
  uint8_t z;

  /*! '0' for positive input and '1' for negative input */
  uint8_t sign;
};

/*!
 * @brief Structure to store temporary accelerometer values
 */
struct bmi3_foc_temp_value {
  /*! X data */
  int32_t x;

  /*! Y data */
  int32_t y;

  /*! Z data */
  int32_t z;
};

/*!
 * @brief Structure to store accelerometer data deviation from ideal value
 */
struct bmi3_offset_delta {
  /*! X axis */
  int16_t x;

  /*! Y axis */
  int16_t y;

  /*! Z axis */
  int16_t z;
};

#endif /* _BMI3_DEFS_H */
